kylefoxaustin/qemu-imxrt1180/hw/net/imxrt1180_netc.c
/*
 * NXP i.MX RT1180 NETC — integrated PCIe Ethernet controller (ENETC endpoint).
 *
 * The NETC is a PCIe-structured block (config headers + ENETC controllers +
 * Station Interfaces + switch + EMDIO + PTP) spanning 0x6000_0000..0x60C1_xxxx.
 * This models the ENETC endpoint path exercised by the SDK netc_txrx_transfer
 * example, which runs as an internal MAC loopback (PHY local-loopback in the
 * firmware) and self-checks that each received frame equals the transmitted one.
 *
 * Modelled behaviours (all register offsets/masks from the MIMXRT1189 DFP):
 *   - NETC_PRIV NETCRR/NETCSR: IERB lock/unlock + soft-reset self-clear.
 *   - PCI config headers: PCI_CFH_CMD RW; PCI_CFC_PCIE_DEV_CTL INIT_FLR
 *     write-1-self-clear (the driver spins on the FLR bit).
 *   - ENETC capability regs (ECAPR1/2) + SI capability (SIPCAPR1): report enough
 *     TX/RX BD rings and MSI-X vectors that the driver's resource checks pass.
 *   - EMDIO + a behavioural RTL8201 PHY: ID match, reset self-clear, link-up.
 *   - TX->RX BD loopback: writing the TX producer index DMAs the frame from the
 *     TX BD, copies it into the RX ring's buffer, writes the RX BD back ready,
 *     and emits the TX/RX MSI-X messages so the driver's completion path runs.
 *   - SWITCH (SW0) NTMP command-BD ring + L2 tables: the fsl_netc_switch driver
 *     programs the switch's tables over a command BD ring (CBDRPIR doorbell ->
 *     process BD -> advance CBDRCIR).  We run add / query / update / delete
 *     synchronously for the forwarding database (FDB, {MAC,FID}->portBitmap) and
 *     the VLAN filter table (VF, VID->{FID, port membership}).  Multi-SI port
 *     forwarding and PTP are not yet modelled (unmodelled tables fault honestly
 *     via the BD's resp.error, never a silent ack).
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */
#include "qemu/osdep.h"
#include "qemu/log.h"
#include "hw/core/sysbus.h"
#include "hw/net/imxrt1180_netc.h"
#include "system/dma.h"
#include "system/address-spaces.h"
#include "exec/memattrs.h"
#include "qemu/bswap.h"
#include "net/net.h"
#include "hw/core/qdev-properties.h"
#include "migration/vmstate.h"

/* ---- Region-relative block offsets (base 0x6000_0000) -------------------- */
#define NETC_PRIV_BASE     0x900000
#define R_NETCRR           (NETC_PRIV_BASE + 0x100)  /* SR=1, LOCK=2 */
#define R_NETCSR           (NETC_PRIV_BASE + 0x104)  /* reads 0 (STATE/ERROR clear) */
#define NETCRR_SR          0x1
#define NETCRR_LOCK        0x2

#define ENETC0_BASE_OFF    0xB10000
#define R_ECAPR0           (ENETC0_BASE_OFF + 0x0)
#define R_ECAPR1           (ENETC0_BASE_OFF + 0x4)   /* NUM_MSIX[22:12], NUM_VSI[27:24] */
#define R_ECAPR2           (ENETC0_BASE_OFF + 0x8)   /* NUM_TX_BDR[9:0], NUM_RX_BDR[25:16] */

#define ENETC0_SI0_OFF     0xB00000
#define R_SIPCAPR1         (ENETC0_SI0_OFF + 0x24)   /* NUM_MSIX[17:12] */

/* ENETC0 Ethernet MAC/link block (0x60B15000): PMn_COMMAND_CONFIG.SWR is a
 * self-clearing software reset the driver spins on. */
#define ENETC0_ETH_OFF     0xB15000
#define R_PM0_CMD_CFG      (ENETC0_ETH_OFF + 0x008)
#define R_PM1_CMD_CFG      (ENETC0_ETH_OFF + 0x408)
#define PM_CMD_CFG_SWR     0x4000000u

/* Capability values: 8 TX + 8 RX BD rings, plenty of MSI-X, 0 VSIs. */
#define ECAPR1_VAL   ((6u << 12))                    /* NUM_MSIX=6, NUM_VSI=0 */
#define ECAPR2_VAL   ((8u << 0) | (8u << 16))        /* NUM_TX_BDR=8, NUM_RX_BDR=8 */
#define SIPCAPR1_VAL ((6u << 12))                    /* NUM_MSIX=6 */

/* EMDIO controller (within EMDIO_BASE @0x60BA0000, struct offset 0x1C00). */
#define EMDIO_OFF          0xBA0000
#define R_EMDIO_CFG        (EMDIO_OFF + 0x1C00)       /* BSY1=bit31, BSY2=bit0 */
#define R_EMDIO_CTL        (EMDIO_OFF + 0x1C04)       /* READ=bit15, PORT[9:5], DEV[4:0] */
#define R_EMDIO_DATA       (EMDIO_OFF + 0x1C08)
#define EMDIO_CFG_BSY      0x80000001u
#define EMDIO_CTL_READ     0x8000u
#define EMDIO_CTL_DEV_MASK 0x1Fu

/* Behavioural RTL8201 PHY: devId = (ID1<<16)|ID2 must equal 0x001CC816. */
#define PHY_ID1_VAL        0x001Cu
#define PHY_ID2_VAL        0xC816u
#define PHY_BMCR_RESET     0x8000u
#define PHY_BMCR_LOOPBACK  0x4000u   /* BMCR bit14: PHY local loopback */
/* BMSR: link-up (0x4) + auto-neg-complete (0x20) + capability bits. */
#define PHY_BMSR_VAL       0x782Du

/* PCI config header INIT_FLR bit (PCI_CFC_PCIE_DEV_CTL @+0x48). */
#define PCI_DEVCTL_OFF     0x48
#define PCI_INIT_FLR       0x8000u

/*
 * BD ring registers (ENETC0 SI0, BDR[0]).  Both the TX and RX ring live in the
 * BDR[ring] element at SI+0x8000 (step 0x200): TX regs at +0x00.., RX at +0x100.
 * The example uses ring 0.  Writing TBPIR (the TX producer index) is the "go"
 * trigger that drives the internal TX->RX loopback.
 */
#define R_TBBAR0    (ENETC0_SI0_OFF + 0x8010)
#define R_TBBAR1    (ENETC0_SI0_OFF + 0x8014)
#define R_TBPIR     (ENETC0_SI0_OFF + 0x8018)   /* TX producer index (trigger) */
#define R_TBCIR     (ENETC0_SI0_OFF + 0x801C)   /* TX consumer index */
#define R_TBLENR    (ENETC0_SI0_OFF + 0x8020)   /* LENGTH field == #BDs */
#define R_RBMR      (ENETC0_SI0_OFF + 0x8100)   /* RX ring mode; EN = bit 31 */
#define RBMR_EN     (1u << 31)                  /* ENETC_SI_RBMR_EN_MASK */
#define R_RBBSR     (ENETC0_SI0_OFF + 0x8108)
#define R_RBCIR     (ENETC0_SI0_OFF + 0x810C)
#define R_RBBAR0    (ENETC0_SI0_OFF + 0x8110)
#define R_RBBAR1    (ENETC0_SI0_OFF + 0x8114)
#define R_RBPIR     (ENETC0_SI0_OFF + 0x8118)   /* RX producer index (HW-advanced) */
#define R_RBLENR    (ENETC0_SI0_OFF + 0x8120)
#define R_SIMSITRVR0 (ENETC0_SI0_OFF + 0xB00)   /* TX ring 0 -> MSI-X entry idx */
#define R_SIMSIRRVR0 (ENETC0_SI0_OFF + 0xB80)   /* RX ring 0 -> MSI-X entry idx */
#define BDR_LEN_MASK 0x1FFF8u

/* MSI-X table for ENETC0PSI0: 0x60BC0000 + 0x10000*(3+0) = region 0xBF0000. */
#define NETC_MSIX_TABLE 0xBF0000
#define MSIX_CTRL_MASK  0x1u                     /* vector control: mask bit */

/* TX BD (16B): addr@0, bufLen@8, frameLen@10; writeback dword[1] written=bit26.
 * RX BD (16B): standard.addr@0; writeback bufLen@8, error@14, byte15 bit6/7. */
#define TXBD_WB_WRITTEN 0x04000000u              /* dword[1] bit 26 */
#define RXBD_WB_READY   0x40u                    /* byte 15 bit 6 (isReady) */
#define RXBD_WB_FINAL   0x80u                    /* byte 15 bit 7 (isFinal) */
#define NETC_FRAME_MAX  2048

/* PCI config-header block bases (region-relative). */
static const hwaddr netc_pci_hdrs[] = {
    0x0000, 0x1000, 0x2000, 0x3000, 0x4000, 0xF8000, 0x100000,
};

static bool netc_is_pci_flr(hwaddr off)
{
    for (size_t i = 0; i < ARRAY_SIZE(netc_pci_hdrs); i++) {
        if (off == netc_pci_hdrs[i] + PCI_DEVCTL_OFF) {
            return true;
        }
    }
    return false;
}

/* ---- flat byte-backed register store ------------------------------------ */
static uint64_t netc_backing_read(IMXRT1180NETCState *s, hwaddr off, unsigned size)
{
    uint64_t v = 0;
    for (unsigned i = 0; i < size; i++) {
        v |= (uint64_t)s->backing[off + i] << (8 * i);
    }
    return v;
}

