kylefoxaustin/qemu-imxrt1180/hw/net/imxrt1180_netc.c
static void netc_backing_write(IMXRT1180NETCState *s, hwaddr off, uint64_t val,
                               unsigned size)
{
    for (unsigned i = 0; i < size; i++) {
        s->backing[off + i] = (val >> (8 * i)) & 0xFF;
    }
}

/* Behavioural PHY register read (clause-22). */
static uint16_t netc_phy_read(IMXRT1180NETCState *s, uint32_t reg)
{
    switch (reg) {
    case 0:  return s->phy_regs[0] & ~PHY_BMCR_RESET; /* BMCR: reset self-clears */
    case 1:  return PHY_BMSR_VAL;                     /* BMSR: link up */
    case 2:  return PHY_ID1_VAL;
    case 3:  return PHY_ID2_VAL;
    default: return s->phy_regs[reg & 0x1F];
    }
}

static uint32_t netc_reg(IMXRT1180NETCState *s, hwaddr off)
{
    return (uint32_t)netc_backing_read(s, off, 4);
}

/* Emit the MSI-X message for a ring: look up the entry the driver assigned,
 * and if it is unmasked, write msgData to msgAddr (which lands in the MSGINTR
 * router and raises its NVIC line). */
static void netc_emit_msix(IMXRT1180NETCState *s, uint32_t entry_idx)
{
    hwaddr e = NETC_MSIX_TABLE + (hwaddr)entry_idx * 16;
    uint64_t msg_addr = (uint64_t)netc_reg(s, e) | ((uint64_t)netc_reg(s, e + 4) << 32);
    uint32_t msg_data = netc_reg(s, e + 8);
    uint32_t ctrl = netc_reg(s, e + 12);
    uint32_t le;

    if (ctrl & MSIX_CTRL_MASK) {
        return;                 /* vector masked */
    }
    le = cpu_to_le32(msg_data);
    dma_memory_write(s->dma_as, msg_addr, &le, 4, MEMTXATTRS_UNSPECIFIED);
}

/* Deliver one frame into the RX ring: copy it into the posted RX buffer, write
 * the RX BD back ready, advance the RX producer index, emit the RX MSI-X. */
static void netc_deliver_rx(IMXRT1180NETCState *s, const uint8_t *frame,
                            uint32_t len)
{
    uint64_t base = (uint64_t)netc_reg(s, R_RBBAR0) | ((uint64_t)netc_reg(s, R_RBBAR1) << 32);
    uint32_t rlen = netc_reg(s, R_RBLENR) & BDR_LEN_MASK;   /* #BDs */
    uint32_t pir = netc_reg(s, R_RBPIR) & 0xFFFF;
    uint32_t cir;
    hwaddr bd;
    uint8_t sbd[8], wb[16];
    uint64_t buf;

    if (rlen == 0) {
        return;
    }

    /*
     * IS THERE A FREE DESCRIPTOR?  THE MODEL NEVER ASKED, AND THAT WAS SILENT
     * MEMORY CORRUPTION.
     *
     * The RX ring is a producer/consumer ring.  HW produces at RBPIR; SW frees a
     * descriptor by re-posting standard.addr and then writing RBCIR ("Update the Rx
     * consumer index to free idle BD" -- fsl_netc_endpoint.c:1253).  R_RBCIR was
     * DEFINED IN THIS FILE AND NEVER READ, so there was no ring-full check at all.
     *
     * What that cost, measured: the 16-byte writeback below overwrites bytes 0..7 of
     * the descriptor -- which are standard.addr, the buffer pointer the driver posted.
     * So a descriptor that has been used once reads back addr == 0 until the driver
     * re-arms it.  With an 8-BD ring, THE NINTH FRAME OF A BURST WRAPS ONTO A
     * DESCRIPTOR THE GUEST HAS NOT RE-ARMED, reads addr = 0, and we DMA the frame
     * STRAIGHT INTO GUEST ADDRESS ZERO -- while still stamping the descriptor READY,
     * so the driver copies a stale buffer and believes it.
     *
     * And the burst is delivered by our OWN fix for the RX stall: the
     * qemu_flush_queued_packets() below releases everything the socket queued while
     * can_receive() was false, in one go, into a ring that had no way to say no.
     * THE REPAIR AND THE TRIGGER WERE THE SAME COMMIT.
     *
     * Measured on the fleet's staggered 3-node L2 lab (holobench, 2026-07-13), where
     * a node joins a segment that is ALREADY CARRYING TRAFFIC:
     *
     *     node booting into an EMPTY segment   ->  0 frames to address 0
     *     node joining second                  ->  8
     *     node joining LAST, 20s of live wire  -> 88     ... and it still printed PASS,
     *                                                        reporting "peers" whose
     *                                                        source MAC was ITS OWN.
     *
     * A synchronous lab holds that quantity at zero, so it is not merely blind to
     * this -- it is blind BY CONSTRUCTION.
     *
     * Real silicon DROPS a frame it has no descriptor for (and bumps a discard
     * counter).  It does not write into a descriptor the driver still owns.  So do
     * we.  Dropping is also the honest choice against the alternative of applying
     * backpressure here: a wire has no backpressure, and a model that is more
     * forgiving than the silicon ships the bug downstream.
     */
    cir = netc_reg(s, R_RBCIR) & 0xFFFF;
    if (cir >= rlen || ((pir + 1) % rlen) == cir) {
        s->rx_ring_full_drops++;
        /*
         * ONGOING, NOT FIRST-ONLY.  This used to log only on drop #1 -- so a startup
         * transient consumed the one message, and a LATER burst (e.g. a peer rejoining a
         * loaded segment while the ring is chronically full) dropped frames SILENTLY.
         *
         * holobench, 2026-07-15, on rt1180's 47s peer re-acquire: "does the node log RX
         * ring full during the gap?"  With first-only logging the honest answer was "it
         * couldn't tell you" -- the instrument was blind exactly when the finding needed
         * it.  ⭐ A DROP COUNTER THAT ANNOUNCES ONCE CANNOT TESTIFY ABOUT A BURST.  So log
         * the first, then periodically with the RUNNING TOTAL, so a sustained ring-full
         * during a rejoin shows up as rising counts on the (-d guest_errors) log the lab
         * can capture.  (mcxn947qemu is adding the on-the-wire version on their 1-deep
         * ring; this is the same discipline on our side: let the subject testify.)
         */
        if (s->rx_ring_full_drops == 1 || (s->rx_ring_full_drops % 64u) == 0) {
            qemu_log_mask(LOG_GUEST_ERROR,
                          "imxrt1180-netc: RX ring full (pir=%u cir=%u len=%u) -- frame "
                          "dropped (total %u). The guest is not consuming descriptors as "
                          "fast as the wire delivers them.\n",
                          pir, cir, rlen, (unsigned)s->rx_ring_full_drops);
        }
        return;
    }

