kylefoxaustin/qemu-imxrt1180/hw/net/imxrt1180_netc.c
    bd = base + (hwaddr)pir * 16;
    dma_memory_read(s->dma_as, bd, sbd, 8, MEMTXATTRS_UNSPECIFIED);
    buf = ldq_le_p(sbd);                         /* standard.addr (SW-posted) */
    dma_memory_write(s->dma_as, buf, frame, len, MEMTXATTRS_UNSPECIFIED);

    memset(wb, 0, sizeof(wb));
    stw_le_p(wb + 8, len);                       /* writeback.bufLen */
    wb[14] = 0;                                  /* error */
    wb[15] = RXBD_WB_READY | RXBD_WB_FINAL;      /* isReady | isFinal */
    dma_memory_write(s->dma_as, bd, wb, 16, MEMTXATTRS_UNSPECIFIED);

    netc_backing_write(s, R_RBPIR, (pir + 1) % rlen, 4);
    netc_emit_msix(s, netc_reg(s, R_SIMSIRRVR0));
}

/* TX producer written: walk the new TX BDs, form each frame, write the BD back
 * done, loop it into the RX ring, then emit the TX MSI-X. */
static void netc_do_tx(IMXRT1180NETCState *s)
{
    uint64_t base = (uint64_t)netc_reg(s, R_TBBAR0) | ((uint64_t)netc_reg(s, R_TBBAR1) << 32);
    uint32_t tlen = netc_reg(s, R_TBLENR) & BDR_LEN_MASK;   /* #BDs */
    uint32_t cir = netc_reg(s, R_TBCIR) & 0xFFFF;
    uint32_t pir = netc_reg(s, R_TBPIR) & 0xFFFF;

    if (tlen == 0) {
        return;
    }
    while (cir != pir) {
        hwaddr bd = base + (hwaddr)cir * 16;
        uint8_t txbd[16], frame[NETC_FRAME_MAX];
        uint64_t addr;
        uint32_t flen, wb;

        dma_memory_read(s->dma_as, bd, txbd, 16, MEMTXATTRS_UNSPECIFIED);
        addr = ldq_le_p(txbd);
        flen = lduw_le_p(txbd + 10);             /* standard.frameLen */
        if (flen == 0 || flen > NETC_FRAME_MAX) {
            flen = lduw_le_p(txbd + 8);          /* fall back to bufLen */
        }
        if (flen > NETC_FRAME_MAX) {
            flen = NETC_FRAME_MAX;
        }
        dma_memory_read(s->dma_as, addr, frame, flen, MEMTXATTRS_UNSPECIFIED);

        wb = cpu_to_le32(TXBD_WB_WRITTEN);       /* written=1, status=success */
        dma_memory_write(s->dma_as, bd + 8, &wb, 4, MEMTXATTRS_UNSPECIFIED);

        if (s->phy_regs[0] & PHY_BMCR_LOOPBACK) {
            /* PHY local loopback: the frame U-turns back into our own RX ring
             * (this is what the SDK netc_txrx_transfer example relies on). */
            netc_deliver_rx(s, frame, flen);
        } else {
            /* Normal operation: put the frame on the wire (the netdev). */
            qemu_send_packet(qemu_get_queue(s->nic), frame, flen);
        }
        cir = (cir + 1) % tlen;
    }
    netc_backing_write(s, R_TBCIR, cir, 4);
    netc_emit_msix(s, netc_reg(s, R_SIMSITRVR0));
}

/* ---- Ethernet backend (netdev) ------------------------------------------ */
static bool netc_can_receive(NetClientState *nc)
{
    IMXRT1180NETCState *s = qemu_get_nic_opaque(nc);
    /*
     * READY MEANS "THE GUEST HAS ENABLED THE RING", NOT "THE GUEST HAS SIZED IT".
     *
     * This used to gate on RBLENR != 0, and that is TOO EARLY BY SEVERAL STEPS.
     * The driver's ring bring-up is, in order (fsl_netc_hw_si.c:63-75, then
     * fsl_netc_endpoint.c:163, then fsl_netc_hw_si.h:119):
     *
     *     RBBAR0/1 = ring base
     *     RBPIR = 0 ; RBCIR = 0
     *     RBLENR = len            <-- we used to declare ourselves READY here
     *     RBMR   = mode bits
     *     ... the EP layer now posts standard.addr into EVERY descriptor ...
     *     RBMR |= EN              <-- the ring is ACTUALLY armed only here
     *
     * Gating on RBLENR meant we began delivering into a ring whose descriptors had
     * NO BUFFER ADDRESS YET -- addr reads back 0 -- so we DMA'd frames straight into
     * GUEST ADDRESS ZERO and stamped the descriptors READY over the driver's own
     * half-finished setup. Measured on the fleet's staggered 3-node lab: a node
     * joining a segment already carrying traffic took 88 such frames and still
     * printed PASS, reporting "peers" whose source MAC was its own.
     *
     * EN is the guest's own statement that the buffers are posted. Believe that, and
     * nothing else.
     */
    return (netc_reg(s, R_RBMR) & RBMR_EN) != 0;
}

static ssize_t netc_receive(NetClientState *nc, const uint8_t *buf, size_t size)
{
    IMXRT1180NETCState *s = qemu_get_nic_opaque(nc);
    uint32_t len = size > NETC_FRAME_MAX ? NETC_FRAME_MAX : (uint32_t)size;

    /* Inbound frame from the wire -> into the RX ring (+ RX MSI-X). */
    netc_deliver_rx(s, buf, len);
    return size;
}

static NetClientInfo netc_net_info = {
    .type = NET_CLIENT_DRIVER_NIC,
    .size = sizeof(NICState),
    .can_receive = netc_can_receive,
    .receive = netc_receive,
};

/* ============ NETC switch: NTMP command-BD ring + FDB table ================
 *
 * The switch driver (fsl_netc_switch + fsl_netc_hw) programs the L2 forwarding
 * database and VLAN filter over a "command BD ring" using the NETC Table
 * Management Protocol (NTMP).  Per operation it writes a 32-byte command BD into
 * the ring, then rings the doorbell CBDRPIR = (index+1)%len and SPINS on
 *   while (producerIndex != CBDRCIR)
 * -- there is no busy bit; completion IS hardware advancing CBDRCIR to the
 * producer index (NETC_CmdBDSendCommand, fsl_netc_hw.c).  We process the BD
 * synchronously on the CBDRPIR write and set CBDRCIR = CBDRPIR, releasing the
 * spin.  A command that we do not model must fault through the BD's own error
 * field (resp.error), never by leaving CBDRCIR behind -- that would HANG the
 * driver instead of telling it.
 *
 * Register offsets/masks: PERI_NETC_SW.h (SW0 @ 0x60A00000).  BD + table byte
 * offsets: fsl_netc.h, compiler-verified.
 */
#define SW0_OFF            0xA00000               /* SW0_BASE - NETC base */
#define SW_CBDR_BASE       (SW0_OFF + 0x800)
#define SW_CBDR_STEP       0x30
#define SW_NUM_CBDR        2
#define SWCBDR_MR          0x00                   /* mode; EN = bit 31 */
#define SWCBDR_BAR0        0x10                   /* ring base low (128B-aligned) */
#define SWCBDR_BAR1        0x14                   /* ring base high */
#define SWCBDR_PIR         0x18                   /* producer index (doorbell) */
#define SWCBDR_CIR         0x1C                   /* consumer index (completion) */
#define SWCBDR_LENR        0x20                   /* ring length (#BDs, mult of 8) */
#define SWCBDR_MR_EN       0x80000000u
#define SWCBDR_LEN_MASK    0x7F8u
#define SWCBDR_IDX_MASK    0x3FFu
#define SWCBDR_BAR0_MASK   0xFFFFFF80u

#define NTMP_BD_SIZE       32
/* command BD dword@12: cmd[3:0], accessType[13:12], tableId[23:16]; resp view of
 * the same dword: numMatched[15:0], error[27:16], resReady[31]. */
#define NTMP_TB_FDB        15
#define NTMP_TB_VF         18                      /* VLAN filter table */
#define NTMP_CMD_DELETE    0x1
#define NTMP_CMD_UPDATE    0x2
#define NTMP_CMD_QUERY     0x4
#define NTMP_CMD_ADD       0x8
#define NTMP_ACC_ENTRYID   0                      /* kNETC_EntryIDMatch */
/* NTMP error status (netc_cmd_error_t) -- documented codes, not invented. */
#define NTMP_ERR_NONE      0x00
#define NTMP_ERR_SIZE      0x02                   /* kNETC_SizeError: table full */
#define NTMP_ERR_INV_TABLE 0x80                   /* kNETC_InvTableID */

