kylefoxaustin/qemu-imxrt1180/hw/net/imxrt1180_netc.c
static IMXRT1180NETCFdbEntry *netc_fdb_find_key(IMXRT1180NETCState *s,
                                                const uint8_t *mac, uint16_t fid)
{
    for (int i = 0; i < IMXRT1180_NETC_FDB_SIZE; i++) {
        IMXRT1180NETCFdbEntry *e = &s->fdb[i];
        if (e->valid && e->fid == fid && memcmp(e->mac, mac, 6) == 0) {
            return e;
        }
    }
    return NULL;
}

static IMXRT1180NETCFdbEntry *netc_fdb_find_id(IMXRT1180NETCState *s, uint32_t id)
{
    for (int i = 0; i < IMXRT1180_NETC_FDB_SIZE; i++) {
        if (s->fdb[i].valid && s->fdb[i].entry_id == id) {
            return &s->fdb[i];
        }
    }
    return NULL;
}

/*
 * Execute one FDB (tableId 15) command.  Buffer layout at req_addr
 * (compiler-verified offsets from netc_tb_fdb_{req,rsp}_data_t):
 *   request  (48B): commonHeader@0; union@4 { entryID@4 | keye@4:
 *                   mac[6]@4, fid dword@12 [11:0] }; cfge@36:
 *                   portBitmap dword@36 [23:0], flags dword@40, etEID@44.
 *   response (36B): status@0, entryID@4, keye@8 (mac@8, fid dword@16),
 *                   cfge@20 (portBitmap@20, flags@24, etEID@28), acte@32.
 * cmd is a bitfield (Add 0x8, Update 0x2, Query 0x4, Delete 0x1) so combined
 * ops (AddAndQuery 0xC, QueryAndDelete 0x5) fall out of testing each bit.
 * Returns the NTMP error status and sets *num_matched.
 */
static uint32_t netc_fdb_op(IMXRT1180NETCState *s, unsigned cmd, unsigned acc,
                            uint64_t req_addr, uint16_t *num_matched)
{
    uint8_t rbuf[48];
    IMXRT1180NETCFdbEntry *e = NULL;
    uint32_t err = NTMP_ERR_NONE;

    *num_matched = 0;
    dma_memory_read(s->dma_as, req_addr, rbuf, sizeof(rbuf), MEMTXATTRS_UNSPECIFIED);

    if (cmd & NTMP_CMD_ADD) {
        uint16_t fid = ldl_le_p(rbuf + 12) & 0xFFF;
        e = netc_fdb_find_key(s, rbuf + 4, fid);
        if (!e) {
            for (int i = 0; i < IMXRT1180_NETC_FDB_SIZE && !e; i++) {
                if (!s->fdb[i].valid) {
                    e = &s->fdb[i];
                }
            }
            if (!e) {
                return NTMP_ERR_SIZE;            /* table full -- honest fault */
            }
            memcpy(e->mac, rbuf + 4, 6);
            e->fid = fid;
            e->valid = true;
            e->entry_id = s->fdb_next_id++;
        }
        e->port_bitmap = ldl_le_p(rbuf + 36) & 0xFFFFFF;
        e->cfge_flags  = ldl_le_p(rbuf + 40);
        e->et_eid      = ldl_le_p(rbuf + 44);
        e->dynamic     = (e->cfge_flags >> 11) & 1;
        *num_matched = 1;
    } else if (cmd & NTMP_CMD_UPDATE) {
        e = (acc == NTMP_ACC_ENTRYID)
              ? netc_fdb_find_id(s, ldl_le_p(rbuf + 4))
              : netc_fdb_find_key(s, rbuf + 4, ldl_le_p(rbuf + 12) & 0xFFF);
        if (e) {
            e->port_bitmap = ldl_le_p(rbuf + 36) & 0xFFFFFF;
            e->cfge_flags  = ldl_le_p(rbuf + 40);
            e->et_eid      = ldl_le_p(rbuf + 44);
            e->dynamic     = (e->cfge_flags >> 11) & 1;
            *num_matched = 1;
        }
    }

    if (cmd & NTMP_CMD_QUERY) {
        if (!e) {
            e = (acc == NTMP_ACC_ENTRYID)
                  ? netc_fdb_find_id(s, ldl_le_p(rbuf + 4))
                  : netc_fdb_find_key(s, rbuf + 4, ldl_le_p(rbuf + 12) & 0xFFF);
        }
        if (e) {
            uint8_t resp[36];
            memset(resp, 0, sizeof(resp));
            stl_le_p(resp + 4, e->entry_id);      /* rsp.entryID */
            memcpy(resp + 8, e->mac, 6);          /* rsp.keye.macAddr */
            stl_le_p(resp + 16, e->fid & 0xFFF);  /* rsp.keye.fid */
            stl_le_p(resp + 20, e->port_bitmap);  /* rsp.cfge.portBitmap */
            stl_le_p(resp + 24, e->cfge_flags);   /* rsp.cfge flags */
            stl_le_p(resp + 28, e->et_eid);       /* rsp.cfge.etEID */
            dma_memory_write(s->dma_as, req_addr, resp, sizeof(resp),
                             MEMTXATTRS_UNSPECIFIED);
            *num_matched = 1;
        }
    }

    if (cmd & NTMP_CMD_DELETE) {
        IMXRT1180NETCFdbEntry *d = (acc == NTMP_ACC_ENTRYID)
              ? netc_fdb_find_id(s, ldl_le_p(rbuf + 4))
              : netc_fdb_find_key(s, rbuf + 4, ldl_le_p(rbuf + 12) & 0xFFF);
        if (d) {
            d->valid = false;
            *num_matched = 1;
        }
    }

    return err;
}

static IMXRT1180NETCVlanEntry *netc_vlan_find_vid(IMXRT1180NETCState *s, uint16_t vid)
{
    for (int i = 0; i < IMXRT1180_NETC_VF_SIZE; i++) {
        if (s->vlan[i].valid && s->vlan[i].vid == vid) {
            return &s->vlan[i];
        }
    }
    return NULL;
}

static IMXRT1180NETCVlanEntry *netc_vlan_find_id(IMXRT1180NETCState *s, uint32_t id)
{
    for (int i = 0; i < IMXRT1180_NETC_VF_SIZE; i++) {
        if (s->vlan[i].valid && s->vlan[i].entry_id == id) {
            return &s->vlan[i];
        }
    }
    return NULL;
}

/*
 * Execute one VLAN-filter (tableId 18) command.  Buffer layout at req_addr
 * (compiler-verified from netc_tb_vf_{req,rsp}_data_t):
 *   request  (24B): commonHeader@0; union@4 { entryID@4 | keye@4: vid dword@4
 *                   [11:0] }; cfge@8 (16 raw bytes: portMembership@8 [23:0],
 *                   fid dword@12 [11:0], etaBitmap@16, baseETEID@20).
 *   response (28B): status@0, entryID@4, keye@8 (vid dword@8), cfge@12 (16 bytes).
 * The VLAN filter maps a VID to a filtering-ID (FID) and a VLAN port membership;
 * the FDB lookup's fid comes from here.  Same NTMP mechanism as the FDB.
 */
static uint32_t netc_vf_op(IMXRT1180NETCState *s, unsigned cmd, unsigned acc,
                           uint64_t req_addr, uint16_t *num_matched)
{
    uint8_t rbuf[24];
    IMXRT1180NETCVlanEntry *e = NULL;

    *num_matched = 0;
    dma_memory_read(s->dma_as, req_addr, rbuf, sizeof(rbuf), MEMTXATTRS_UNSPECIFIED);

    if (cmd & NTMP_CMD_ADD) {
        uint16_t vid = ldl_le_p(rbuf + 4) & 0xFFF;
        e = netc_vlan_find_vid(s, vid);
        if (!e) {
            for (int i = 0; i < IMXRT1180_NETC_VF_SIZE && !e; i++) {
                if (!s->vlan[i].valid) {
                    e = &s->vlan[i];
                }
            }
            if (!e) {
                return NTMP_ERR_SIZE;
            }
            e->vid = vid;
            e->valid = true;
            e->entry_id = s->vlan_next_id++;
        }
        for (int i = 0; i < 4; i++) {
            e->cfge[i] = ldl_le_p(rbuf + 8 + i * 4);
        }
        *num_matched = 1;
    } else if (cmd & NTMP_CMD_UPDATE) {
        e = (acc == NTMP_ACC_ENTRYID)
              ? netc_vlan_find_id(s, ldl_le_p(rbuf + 4))
              : netc_vlan_find_vid(s, ldl_le_p(rbuf + 4) & 0xFFF);
        if (e) {
            for (int i = 0; i < 4; i++) {
                e->cfge[i] = ldl_le_p(rbuf + 8 + i * 4);
            }
            *num_matched = 1;
        }
    }

    if (cmd & NTMP_CMD_QUERY) {
        if (!e) {
            e = (acc == NTMP_ACC_ENTRYID)
                  ? netc_vlan_find_id(s, ldl_le_p(rbuf + 4))
                  : netc_vlan_find_vid(s, ldl_le_p(rbuf + 4) & 0xFFF);
        }
        if (e) {
            uint8_t resp[28];
            memset(resp, 0, sizeof(resp));
            stl_le_p(resp + 4, e->entry_id);      /* rsp.entryID */
            stl_le_p(resp + 8, e->vid & 0xFFF);   /* rsp.keye.vid */
            for (int i = 0; i < 4; i++) {
                stl_le_p(resp + 12 + i * 4, e->cfge[i]);  /* rsp.cfge (16 bytes) */
            }
            dma_memory_write(s->dma_as, req_addr, resp, sizeof(resp),
                             MEMTXATTRS_UNSPECIFIED);
            *num_matched = 1;
        }
    }

    if (cmd & NTMP_CMD_DELETE) {
        IMXRT1180NETCVlanEntry *d = (acc == NTMP_ACC_ENTRYID)
              ? netc_vlan_find_id(s, ldl_le_p(rbuf + 4))
              : netc_vlan_find_vid(s, ldl_le_p(rbuf + 4) & 0xFFF);
        if (d) {
            d->valid = false;
            *num_matched = 1;
        }
    }

    return NTMP_ERR_NONE;
}

/* Process one 32-byte NTMP command BD at bd_addr: dispatch on tableId/cmd, then
 * write the response (error/numMatched/resReady) back into the BD's dword@12. */
static void netc_process_cmd_bd(IMXRT1180NETCState *s, uint64_t bd_addr)
{
    uint8_t bd[NTMP_BD_SIZE];
    uint64_t req_addr;
    uint32_t dw3, err;
    unsigned cmd, acc, table_id;
    uint16_t num_matched = 0;

    dma_memory_read(s->dma_as, bd_addr, bd, sizeof(bd), MEMTXATTRS_UNSPECIFIED);
    req_addr = ldq_le_p(bd);                      /* req.addr (data buffer) */
    dw3      = ldl_le_p(bd + 12);
    cmd      = dw3 & 0xF;
    acc      = (dw3 >> 12) & 0x3;
    table_id = (dw3 >> 16) & 0xFF;

    switch (table_id) {
    case NTMP_TB_FDB:
        err = netc_fdb_op(s, cmd, acc, req_addr, &num_matched);
        break;
    case NTMP_TB_VF:
        err = netc_vf_op(s, cmd, acc, req_addr, &num_matched);
        break;
    default:
        /* We do not model this table yet.  TELL THE DRIVER via the BD's own error
         * field (a documented, non-gating channel) instead of faking success -- a
         * silent ack over an unprogrammed table is a lie the driver cannot see. */
        qemu_log_mask(LOG_UNIMP, "imxrt1180-netc: NTMP command for unmodelled "
                      "table %u (cmd 0x%x) -- returning kNETC_InvTableID (flagged)\n",
                      table_id, cmd);
        err = NTMP_ERR_INV_TABLE;
        break;
    }

    /* Response into dword@12: numMatched[15:0], error[27:16], resReady[31]. */
    stl_le_p(bd + 12, (num_matched & 0xFFFF) | ((err & 0xFFF) << 16) | (1u << 31));
    dma_memory_write(s->dma_as, bd_addr + 12, bd + 12, 4, MEMTXATTRS_UNSPECIFIED);
}

/* CBDRPIR (doorbell) written for a ring: process every BD between the consumer
 * index and the new producer index, then advance CBDRCIR to release the driver's
 * spin-wait (which polls CBDRCIR == producerIndex). */
static void netc_cbdr_doorbell(IMXRT1180NETCState *s, unsigned ring)
{
    hwaddr rbase = SW_CBDR_BASE + (hwaddr)ring * SW_CBDR_STEP;
    uint64_t ring_base;
    uint32_t len, pir, cir, guard = 0;

