kylefoxaustin/qemu-imxrt1180/hw/net/imxrt1180_netc.c
    if (!(netc_reg(s, rbase + SWCBDR_MR) & SWCBDR_MR_EN)) {
        return;                                   /* ring disabled */
    }
    len = netc_reg(s, rbase + SWCBDR_LENR) & SWCBDR_LEN_MASK;
    if (len == 0) {
        return;
    }
    ring_base = (uint64_t)(netc_reg(s, rbase + SWCBDR_BAR0) & SWCBDR_BAR0_MASK) |
                ((uint64_t)netc_reg(s, rbase + SWCBDR_BAR1) << 32);
    pir = netc_reg(s, rbase + SWCBDR_PIR) & SWCBDR_IDX_MASK;
    cir = netc_reg(s, rbase + SWCBDR_CIR) & SWCBDR_IDX_MASK;

    while (cir != pir && guard++ <= len) {
        netc_process_cmd_bd(s, ring_base + (uint64_t)cir * NTMP_BD_SIZE);
        cir = (cir + 1) % len;
    }
    netc_backing_write(s, rbase + SWCBDR_CIR, pir, 4);   /* completion */
}

/* Is off a CBDRPIR doorbell register for some switch command BD ring? */
static bool netc_is_cbdr_pir(hwaddr off, unsigned *ring)
{
    for (unsigned r = 0; r < SW_NUM_CBDR; r++) {
        if (off == SW_CBDR_BASE + (hwaddr)r * SW_CBDR_STEP + SWCBDR_PIR) {
            *ring = r;
            return true;
        }
    }
    return false;
}

static uint64_t netc_read(void *opaque, hwaddr off, unsigned size)
{
    IMXRT1180NETCState *s = opaque;

    if (netc_is_pci_flr(off)) {
        /* INIT_FLR always reads clear: the FLR-complete poll exits at once. */
        return netc_backing_read(s, off, size) & ~(uint64_t)PCI_INIT_FLR;
    }

    switch (off) {
    case R_NETCSR:   return 0;                          /* STATE/ERROR clear */
    case R_NETCRR:   return netc_backing_read(s, off, size) & ~(uint64_t)NETCRR_SR;
    case R_ECAPR0:   return 0;
    case R_ECAPR1:   return ECAPR1_VAL;
    case R_ECAPR2:   return ECAPR2_VAL;
    case R_SIPCAPR1: return SIPCAPR1_VAL;
    case R_EMDIO_CFG: return netc_backing_read(s, off, size) & ~(uint64_t)EMDIO_CFG_BSY;
    case R_EMDIO_DATA: return netc_phy_read(s, s->mdio_reg);
    case R_PM0_CMD_CFG:
    case R_PM1_CMD_CFG:                                  /* MAC SWR self-clears */
        return netc_backing_read(s, off, size) & ~(uint64_t)PM_CMD_CFG_SWR;
    default:
        return netc_backing_read(s, off, size);
    }
}

static void netc_write(void *opaque, hwaddr off, uint64_t val, unsigned size)
{
    IMXRT1180NETCState *s = opaque;
    unsigned ring;

    /*
     * NTMP command-BD doorbell: the switch driver writes CBDRPIR to launch a
     * table (FDB/VLAN) operation, then spins on CBDRCIR.  Store the index, run
     * the command(s), and advance CBDRCIR to release the spin.
     */
    if (netc_is_cbdr_pir(off, &ring)) {
        netc_backing_write(s, off, val, size);
        netc_cbdr_doorbell(s, ring);
        return;
    }

    /*
     * RX-QUEUE RESTART.
     *
     * netc_can_receive() reports "not ready" until the guest has configured the RX
     * ring (RBLENR != 0). When a NetClientInfo.can_receive returns false, QEMU
     * STALLS that peer's queue and does NOT retry on its own -- the device must
     * call qemu_flush_queued_packets() once it can accept again. We never did.
     *
     * So a frame arriving in the window between the NIC coming up and the guest
     * programming its RX ring stalled the queue PERMANENTLY: that instance never
     * received another frame, for the life of the run.
     *
     * Invisible in every 2-node test we had, because both ends boot together and
     * neither transmits before the other is listening. It took a THREE-node
     * segment -- where two peers are already broadcasting when the third comes up
     * -- to expose it, and it presented as "two nodes are deaf and the third is
     * fine", which is exactly what a stalled queue looks like.
     */
    if (off == R_RBMR && (val & RBMR_EN)) {
        netc_backing_write(s, off, val, size);
        qemu_flush_queued_packets(qemu_get_queue(s->nic));
        return;
    }

    /*
     * The guest freed descriptors. Anything QEMU stalled because our ring was FULL
     * can move now -- and if we do not say so, QEMU never retries on its own. This
     * is the same lesson as the flush above, on the other end of the ring: a
     * can_receive() that has ever returned false MUST be paired with a flush at
     * every point where it could become true again, or the queue stays stalled
     * forever and the node goes silently deaf.
     */
    if (off == R_RBCIR) {
        netc_backing_write(s, off, val, size);
        qemu_flush_queued_packets(qemu_get_queue(s->nic));
        return;
    }

    switch (off) {
    case R_EMDIO_CTL:
        /* Latch the addressed PHY register for the following DATA access. */
        s->mdio_reg = val & EMDIO_CTL_DEV_MASK;
        netc_backing_write(s, off, val, size);
        return;
    case R_EMDIO_DATA:
        /* MDIO write: echo into the PHY scratch (read-back for non-special regs). */
        s->phy_regs[s->mdio_reg & 0x1F] = val & 0xFFFF;
        netc_backing_write(s, off, val, size);
        return;
    case R_TBPIR:
        /* TX producer index written -> run the internal TX->RX loopback. */
        netc_backing_write(s, off, val, size);
        netc_do_tx(s);
        return;
    default:
        netc_backing_write(s, off, val, size);
        return;
    }
}

static const MemoryRegionOps netc_ops = {
    .read = netc_read,
    .write = netc_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid.min_access_size = 1,
    .valid.max_access_size = 4,
    .impl.min_access_size = 1,
    .impl.max_access_size = 4,
};

/*
 * RESET VALUES from the RM's cold-POR column.  Offsets are ABSOLUTE within the NETC
 * window (base 0x6000_0000), matching the flat `backing` array.
 *
 * MOST OF THE IERB SET ARE **CAPABILITY** REGISTERS -- CAPR0..3, CMCAPR, IPFTMCAPR,
 * TGSMCAPR, and one L*CAPR per link.  They tell the driver how many SIs, how many
 * BD rings, how deep the tables are.  WE WERE RETURNING ZERO FROM ALL OF THEM.
 *
 * 91emulator's rule, and this is the safe side of it:
 *   "ON A CAPABILITY REGISTER, UNDER-REPORTING IS THE SAFE ERROR DIRECTION.
 *    OVER-REPORTING IS A PROMISE THE EMULATOR MAKES ON THE CHIP'S BEHALF."
 * Zero is under-reporting -- a NIC claiming no rings and no station interfaces --
 * so it fails loudly rather than shipping.  But it is still a lie, and the manual
 * hands us the truth, so there is no reason to keep telling it.
 *
 * The L*BCR link-bandwidth registers matter for a different reason: the driver
 * READ-MODIFY-WRITES them, so our zero would be laundered into its own config.
 */
static const struct { hwaddr off; uint32_t val; } netc_por[] = {
    /* NETC_IERB -- capability + config */
    { 0x800000, 0x01110651 },  /* CAPR0      */
    { 0x800004, 0x000E000E },  /* CAPR1      */
    { 0x800008, 0x00000034 },  /* CAPR2      */
    { 0x80000C, 0x00080008 },  /* CAPR3      */
    { 0x800020, 0x00002800 },  /* CMCAPR     */
    { 0x800030, 0x000000C4 },  /* IPFTMCAPR  */
    { 0x800044, 0x00000700 },  /* TGSMCAPR   */
    { 0x800080, 0x00000040 },  /* SMDTR      */
    { 0x800100, 0x06400200 },  /* HBTMAR     */
    { 0x800104, 0x00000032 },  /* HBTCR      */
    { 0x800170, 0x00000634 },  /* NETCFLRCR  */
    { 0x800178, 0x2AAAAAAA },  /* NETCCLKFR  */
    { 0x80017C, 0x000400F0 },  /* NETCCLKCR  */
    { 0x800180, 0x0000000A },  /* SBCR       */
    { 0x800190, 0x00000014 },  /* SGLTTR     */
    { 0x800300, 0x80000100 },  /* EMDIOBCR   */
    { 0x800350, 0x00000010 },  /* EMDIO_CFG  */
    /* per-link capability / bandwidth (L0..L5) */
    { 0x801000, 0x37077000 },  /* L0CAPR     */
    { 0x801014, 0x00000200 },  /* L0TXBCCTR  */
    { 0x801040, 0x37077000 },  /* L1CAPR     */
    { 0x801050, 0x00000001 },  /* L1BCR      */
    { 0x801054, 0x00000200 },  /* L1TXBCCTR  */
    { 0x801080, 0x37077000 },  /* L2CAPR     */
    { 0x801090, 0x00000002 },  /* L2BCR      */
    { 0x801094, 0x00000200 },  /* L2TXBCCTR  */
    { 0x8010C0, 0x37077000 },  /* L3CAPR     */
    { 0x8010D0, 0x00000003 },  /* L3BCR      */
    { 0x8010D4, 0x00000200 },  /* L3TXBCCTR  */
    { 0x801100, 0x37077000 },  /* L4CAPR     */
    { 0x801110, 0x00000040 },  /* L4BCR      */
    { 0x801114, 0x00000200 },  /* L4TXBCCTR  */
    { 0x801140, 0x37077010 },  /* L5CAPR     */
    { 0x801150, 0x00040041 },  /* L5BCR      */
    { 0x801154, 0x00000200 },  /* L5TXBCCTR  */
    /* PCI SR-IOV capability header, one per function F0..F4 (stride 0x1000) */
    { 0x000150, 0x00010010 },  /* NETC_F0 PCIE_CFC_SRIOV_CAP_HDR */
    { 0x001150, 0x00010010 },  /* NETC_F1 */
    { 0x002150, 0x00010010 },  /* NETC_F2 */
    { 0x003150, 0x00010010 },  /* NETC_F3 */
    { 0x004150, 0x00010010 },  /* NETC_F4 */
};

static void netc_reset(DeviceState *dev)
{
    IMXRT1180NETCState *s = IMXRT1180_NETC(dev);
    memset(s->backing, 0, IMXRT1180_NETC_SIZE);
    for (size_t i = 0; i < ARRAY_SIZE(netc_por); i++) {
        netc_backing_write(s, netc_por[i].off, netc_por[i].val, 4);
    }
    memset(s->phy_regs, 0, sizeof(s->phy_regs));
    s->mdio_reg = 0;
    memset(s->fdb, 0, sizeof(s->fdb));
    s->fdb_next_id = 0;
    memset(s->vlan, 0, sizeof(s->vlan));
    s->vlan_next_id = 0;
}

static void netc_realize(DeviceState *dev, Error **errp)
{
    IMXRT1180NETCState *s = IMXRT1180_NETC(dev);

