kylefoxaustin/qemu-imxrt1180/hw/net/imxrt1180_netc.c
    s->backing = g_malloc0(IMXRT1180_NETC_SIZE);
    s->dma_as = &address_space_memory;
    memory_region_init_io(&s->iomem, OBJECT(s), &netc_ops, s,
                          TYPE_IMXRT1180_NETC, IMXRT1180_NETC_SIZE);
    sysbus_init_mmio(SYS_BUS_DEVICE(dev), &s->iomem);

    qemu_macaddr_default_if_unset(&s->conf.macaddr);
    s->nic = qemu_new_nic(&netc_net_info, &s->conf,
                          object_get_typename(OBJECT(dev)), dev->id,
                          &dev->mem_reentrancy_guard, s);
    qemu_format_nic_info_str(qemu_get_queue(s->nic), s->conf.macaddr.a);
}

static void netc_unrealize(DeviceState *dev)
{
    IMXRT1180NETCState *s = IMXRT1180_NETC(dev);
    g_free(s->backing);
}

static const VMStateDescription vmstate_netc_fdb = {
    .name = "imxrt1180-netc/fdb-entry",
    .version_id = 1,
    .minimum_version_id = 1,
    .fields = (const VMStateField[]) {
        VMSTATE_BOOL(valid, IMXRT1180NETCFdbEntry),
        VMSTATE_BOOL(dynamic, IMXRT1180NETCFdbEntry),
        VMSTATE_UINT8_ARRAY(mac, IMXRT1180NETCFdbEntry, 6),
        VMSTATE_UINT16(fid, IMXRT1180NETCFdbEntry),
        VMSTATE_UINT32(port_bitmap, IMXRT1180NETCFdbEntry),
        VMSTATE_UINT32(cfge_flags, IMXRT1180NETCFdbEntry),
        VMSTATE_UINT32(et_eid, IMXRT1180NETCFdbEntry),
        VMSTATE_UINT32(entry_id, IMXRT1180NETCFdbEntry),
        VMSTATE_END_OF_LIST()
    },
};

static const VMStateDescription vmstate_netc_vlan = {
    .name = "imxrt1180-netc/vlan-entry",
    .version_id = 1,
    .minimum_version_id = 1,
    .fields = (const VMStateField[]) {
        VMSTATE_BOOL(valid, IMXRT1180NETCVlanEntry),
        VMSTATE_UINT16(vid, IMXRT1180NETCVlanEntry),
        VMSTATE_UINT32(entry_id, IMXRT1180NETCVlanEntry),
        VMSTATE_UINT32_ARRAY(cfge, IMXRT1180NETCVlanEntry, 4),
        VMSTATE_END_OF_LIST()
    },
};

static const VMStateDescription vmstate_netc = {
    .name = TYPE_IMXRT1180_NETC,
    .version_id = 3,
    .minimum_version_id = 3,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT32(mdio_reg, IMXRT1180NETCState),
        VMSTATE_UINT16_ARRAY(phy_regs, IMXRT1180NETCState, 32),
        VMSTATE_STRUCT_ARRAY(fdb, IMXRT1180NETCState, IMXRT1180_NETC_FDB_SIZE, 1,
                             vmstate_netc_fdb, IMXRT1180NETCFdbEntry),
        VMSTATE_UINT32(fdb_next_id, IMXRT1180NETCState),
        VMSTATE_STRUCT_ARRAY(vlan, IMXRT1180NETCState, IMXRT1180_NETC_VF_SIZE, 1,
                             vmstate_netc_vlan, IMXRT1180NETCVlanEntry),
        VMSTATE_UINT32(vlan_next_id, IMXRT1180NETCState),
        VMSTATE_END_OF_LIST()
    },
};

static const Property netc_properties[] = {
    DEFINE_NIC_PROPERTIES(IMXRT1180NETCState, conf),
};

static void netc_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);
    dc->realize = netc_realize;
    dc->unrealize = netc_unrealize;
    device_class_set_legacy_reset(dc, netc_reset);
    dc->vmsd = &vmstate_netc;
    device_class_set_props(dc, netc_properties);
}

static const TypeInfo netc_types[] = {
    {
        .name = TYPE_IMXRT1180_NETC,
        .parent = TYPE_SYS_BUS_DEVICE,
        .instance_size = sizeof(IMXRT1180NETCState),
        .class_init = netc_class_init,
    },
};
DEFINE_TYPES(netc_types)
